<?php
// 1. Додайте PHP-код, який виводить на екран текст "Hello, World!".
echo "Hello, World!\n";

// 2. Оголосіть змінні різних типів: рядок, ціле число, число з плаваючою комою, булеве значення.
$string = "Ярослав";
$int = 3;
$float = 3.3;
$bool = true;

// Виведіть значення змінних на екран, використовуючи функцію echo.
echo "Змінна рядок: $string\n";
echo "Змінна ціле число: $int\n";
echo "Змінна число з плаваючою комою: $float\n";
echo "Змінна булеве значення: $bool\n";

// Виведіть тип кожної змінної, використовуючи функцію var_dump.
var_dump($string);
var_dump($int);
var_dump($float);
var_dump($bool);

// 3. Конкатенація рядків
$first_name = "Ярослав";
$last_name = "Бєлєвець";

// Об'єднайте ці змінні в один рядок та виведіть результат на екран.
$full_name = $first_name . " " . $last_name; // об'єднання рядків
echo "Повне ім'я: $full_name\n";

// 4. Створіть змінну з будь-яким числовим значенням.
$number = 7;

//Реалізуйте умовну конструкцію if-else, яка перевіряє, чи є це число парним або непарним, і виводить відповідне повідомлення на екран.
if ($number % 2 == 0) {
    echo "$number парне число\n";
} else {
    echo "$number непарне число\n";
}

// 5. Використовуючи цикл for, виведіть на екран числа від 1 до 10.

for ($i = 1; $i <= 10; $i++) {
    echo $i . "\n";
}

// Використовуючи цикл while, виведіть на екран числа від 10 до 1.
$i = 10;
while ($i >= 1) {
    echo $i . "\n";
    $i--;
}

// 6. Створіть асоціативний масив, що містить інформацію про студента: ім'я, прізвище, вік, спеціальність.
$student = [
    "first_name" => "Ярослав",
    "last_name" => "Бєлєвець",
    "age" => 21,
    "speciality" => 122
];

// Виведіть значення кожного елемента масиву на екран.
foreach ($student as $key => $value) {
    echo "$key: $value\n";
}

// Додайте новий елемент до масиву, який зберігає середній бал студента, і виведіть оновлений масив.
$student["average_grade"] = 4;
foreach ($student as $key => $value) {
    echo "$key: $value\n";
}